In [12]:
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [7]:
titles['decade'] = titles['year']//10 * 10
titles.groupby('decade').title.count()

decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: title, dtype: int64

### Use groupby() count the number of "Hamlet" films made in each decade.

In [8]:
titles[titles['title'] == 'Hamlet'].groupby('decade').count()

        title  year
decade
1910        3     3
1920        1     1
1940        1     1
1950        1     1
1960        2     2
1970        2     2
1980        1     1
1990        2     2
2000        2     2
2010        3     3

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [15]:
cast[cast['n'] == 1 & np.isin(cast['year'],[range(1950,1960)])].groupby(['year', 'type']).title.count()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
Name: title, dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [19]:
cast[np.isin(cast['year'], range(1950,1960)) & np.isin(cast['n'],range(1,6))].groupby(['type','n']).title.count()

type     n
actor    1.0    6616
         2.0    4564
         3.0    5587
         4.0    5594
         5.0    5611
actress  1.0    2965
         2.0    4556
         3.0    3148
         4.0    2849
         5.0    2544
Name: title, dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [23]:
cast[cast['title'].str.contains("Pink Panther")].groupby('title').character.count()

title
Curse of the Pink Panther          67
Revenge of the Pink Panther        64
Son of the Pink Panther            46
The Pink Panther                  111
The Pink Panther 2                 84
The Pink Panther Strikes Again     68
The Return of the Pink Panther     30
Trail of the Pink Panther          41
Name: character, dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [43]:
grouped = cast[cast['name'] == 'Frank Oz'].groupby('title', as_index=False).agg({'character': 'count', 'year' : 'first'})
grouped[grouped['character'] > 1].sort_values('year')

                                   title  character  year
22                      The Muppet Movie          8  1979
0         An American Werewolf in London          2  1981
20                The Great Muppet Caper          6  1981
19                      The Dark Crystal          2  1982
23            The Muppets Take Manhattan          7  1984
2                       Follow That Bird          3  1985
21            The Muppet Christmas Carol          7  1992
7                 Muppet Treasure Island          4  1996
8                     Muppets from Space          4  1999
17  The Adventures of Elmo in Grouchland          3  1999

### List each of the characters that Frank Oz has portrayed at least twice.

In [46]:
grouped = cast[cast['name'] == 'Frank Oz'].groupby('character').agg({'title': 'count'})
grouped[grouped['title'] > 1]

                title
character
Animal              6
Bert                3
Cookie Monster      3
Fozzie Bear         4
Grover              2
Miss Piggy          6
Sam the Eagle       5
Yoda                6